Revit 2024 API
ValueAtPointBase.ClearAllFlags Method
 Sets flags for all measurements to ValueAtPointFlags::None.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void ClearAllFlags()
Visual Basic
Public Sub ClearAllFlags
Visual C++
public:
void ClearAllFlags()
See Also
ValueAtPointBase Class
Autodesk.Revit.DB Namespace